---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AreaReinforcementType
source: html/4f46e7f0-4f1c-b34f-1c5a-452550c75e55.htm
---
# AreaReinforcementType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.